package main

import (
	"fmt"
	"github.com/duke-git/lancet/v2/strutil"
)

func main() {
	fmt.Println(strutil.Reverse("hello"))
}

// (/v3/u/order/getAppOrderList)|(/v3/u/order/orderEffective)|(/v3/u/package/canMigrate)|(/v3/u/package/migrateResource)|(/v3/u/package/receivePackageNow)|

// 好好说话系列
// 治愈系赛道

// 主要是看其他因素
// 上涨是预期 预期落地就做空

// 但是他们不是事情的操盘手 玩转心理

// 顺势而为 消息面 庄也是要顺势而为吧 有利空 没有利好

// 消息面起作用

// 劳工统计局 职位空缺 golts 报告
// 服务业活动加速 反应通胀上升
// 影响通胀的数据有哪些
// 国债收益率如何影响股市
// 股市 和 债市
// 把握经济活动数据
// 高开低走 影响多头
// 利好出近 是利空 英伟达 sell the news ces大展
// 展示出相关的消息

// 我很讨厌世俗的东西 可我又不得不活在世俗里面
//

// 服务业PMI 高于预期 反应继续扩张
// 物价指数
// 降息周期

// 今晚凌晨是老美12月货币会议，重点看看他们怎么聊。
// 结果出来后，结合周四的数据和周五的大非农，市场方向估计就清晰了。
// 现在可以继续盯着5日线，短期上下波动参考它就好。
// 纳指目前涨幅只有0.2%左右，比前几天的0.7%明显弱一些。
// 所以今晚开盘估计也不会太强，币圈也别太乐观，立马反弹上去的概率不大。
// 顺势而为，跟着趋势走才是正道

// 小非农的数据 ADP公司
// 大非农 美国劳工统计局
// 当前大家对公布数据的预期 大趋势是什么
// 利率 通胀 国债 经济强劲 泡沫 经济增长性 流动性 套息交易

// 走好消息就是坏消息 投资者的预期 对华尔街加息或者降息的可能性
// cpi 数据
// 美联储的步调是什么

// 什么时候会做空 机构做盘

// 长期利率飙涨 导致利率暴跌
